{
  "Id": "band/1066",
  "BandName": "Dirty Hearts Club",
  "MainContactName": null,
  "OtherContacts": [],
  "ContactEmail": null,
  "AverageAge": null,
  "Bio": "Formerly \"Dirty Hands\", the Dirty Hearts Club was formed from the debris of the Dirty Hands. The demise of the Dirty Hands left Patt Jenkinson and Danny Solazzo with a batch of unused material in which they had great belief. Towards the end of 2010, Solazzo began to work with Chas Dewhurst and contacted Jenkinson over Christmas to float the idea of a new band using their old material and the new songs he had crafted with Dewhurst. The three took the decision form a band. It was immediately decided that Ste Mills, drummer from the previous band was first choice on the kit and Mills took little persuasion to dig out his sticks for another go. Jenkinson had already decided to play bass in the new band and the only vacancy remaining was that of the second guitarist. Matt White, Bacup guitarist and long time friend of Danny Solazzo took the role and the line-up was complete.\r\n\r\nThe energy and vigour of the Dirty Hands is re-incarnated in the Dirty Hearts Club and the enthusiasm to explore new styles and influences remains undimmed. With a now three pronged songwriting squad the myriad of topics covered in the Dirty Hearts Club material has grown even wider. National and international issues are explored as well as films, art and literature and the old fashioned intricacies of human relationships.\r\n\r\nWe are sure that there are many good times ahead for the Dirty Hearts Club. We are setting off on a voyage of mystery, discovery and intrigue.\r\n\r\nYou are all invited",
  "Style": "Punk Rock",
  "CoverPercentage": 90,
  "OriginalPercentage": 10,
  "MySpaceLink": "http://www.myspace.com/thedirtyheartsclubuk/",
  "FacebookLink": "https://www.facebook.com/thedirtyheartsclub",
  "OtherLinks": [
    "http://www.thedirtyheartsclub.co.uk/"
  ],
  "NumberOfBandMembers": "5",
  "HomeTown": null
}