{
  "BandName": {
    "Value": "Fox Elipsus"
  },
  "Gigs": [
    {
      "Id": "gig/108546",
      "BandNames": [
        {
          "Value": "Fox Elipsus"
        }
      ],
      "Venue": "San Marcos",
      "Date": "\/Date(1313967600000+0100)\/",
      "StartTime": "19:00",
      "Price": "free",
      "MoreInfo": "FOX ELIPSUS, LIVE IN BLACKPOOL, ALL AGES, FREE CONCERT :D ♥\r\n\r\n- Fox is coming all the way from New York for this\r\n- First ever Fox Elipsus concert in Blackpool!\r\n- Free to attend, no ticket required\r\n- Family friendly, all ages welcome :)\r\n- Fox's 26th of 69 UK shows!\r\n- Fox's only Blackpool performance on this tour :)\r\n- For the 7th time in a row I managed to start a sentence with \"F\"\r\n- How fantastic is that :)\r\n- Fail!\r\n\r\n- - Watch Music Videos: http://www.youtube.com/foxelipsus\r\n- - Hear More Music & Click \"Like\": http://www.facebook.com/foxelipsus\r\n- - Double CDs Cheap @ Official Website: http://www.elipsus.net/\r\n(Fox will sign and personalize your CDs if you bring them to the show!)\r\n(you can read more about Fox's mission on the elipsus.net website)\r\n\r\nFox is trying to help promote peace and saving the environment through his songs. He plays for free all over North America and Europe so that anyone can come and listen without having to pay. He even goes so far as to sleep in the rental car when on tour, to save money so he can keep going. The only way he can keep this going is by word of mouth. If you like what you hear or read, please click \"invite people to come\", select all your friends in the area, then \"send invitations\" so others can know about this. Alternatively, you could just watch Match Of The Day and forget you read this.\r\n\r\nIt means so much to Fox when lots of locals come to see the show. Some cities and areas are unbelievably welcoming and supporting, hopefully Blackpool will be one of those. We'll see, on the 22nd of August, it depends on how many people help out by sending out invites. Come if you can, and bring friends - remember it's free to come to the show, tipping, buying cds, and buying drinks from the cafe is all optional and Fox is only really interested in promoting peace and saving the environment - anything you buy from him online or at the show goes directly to petrol and food money - anything you buy from the cafe during the show is helping to support your local business :) Or you could stay home and watch The X-Factor because that lad from Luton that you like might still be in it.\r\n\r\n\r\nABOUT THE CONCERT & CONTACTING FOX\r\n\r\nThe messages of the music are serious and about issues that affect all of us, but the performance itself is also comical, and you'll probably laugh a lot. But as he often says, it's never quite clear if they're laughing at him, or with him - he doesn't seem to mind which it is :) Fox doesn't check facebook very often, so if you want to reach him fairly quickly, use his personal e-mail address - ELIPSUS@GMAIL.COM - he'd love to hear from you :) He'd also love to hear from John Lennon but that's sadly not on the cards, so perhaps you can write to him to make up for it :)\r\n\r\n\r\nOTHER UPCOMING SHOWS\r\n\r\nIf you're not in Blackpool, or travel a lot, you may want to look at this...\r\nFox is performing in every corner of the UK, Ireland, and Mainland Europe\r\nHere is a full list of concerts, every one of them is free, all ages and family friendly:\r\nhttp://www.facebook.com/note.php?note_id=135680143183024\r\n\r\n\r\nHere are the shows in the next few weeks:\r\n\r\nWeek of Mon 15th Aug\r\n\r\nMon 15th, 6pm - SWANSEA, WALES - Americano Jazz Caffe, Prince of Wales Dock, Kings Rd, SA1 8PP\r\n- http://www.facebook.com/event.php?eid=104302376338248\r\nTue 16th, 8pm - ABERYSTWYTH, WALES - The Scholars, Queen's Rd, SY23 2HH\r\n- http://www.facebook.com/event.php?eid=239431089424812\r\nWed 17th, 6pm - RHYL, WALES - Harkers Corner Cafe, 14 West Parade, LL18 1HE\r\n- http://www.facebook.com/event.php?eid=228482883861172\r\nThu 18th, 6pm - CHESTER - Costa Coffee, 40-42 Frodsham Square (inside Tesco), CH1 3JS\r\n- http://www.facebook.com/event.php?eid=174324119305103\r\nFri 19th, 6pm - WARRINGTON - The Lounge, 6 Springfield St, WA1 1BB\r\n- http://www.facebook.com/event.php?eid=157027224372943\r\nSat 20th, Noon - BOLTON - Starbucks, Bolton Market Place, Town Centre, BL1 2AR\r\n- http://www.facebook.com/event.php?eid=195734043820565\r\nSun 21st, 3.30pm - MANCHESTER - Nexus Art Cafe, 2 Dale St (opposite Vinyl Exchange), M1 1JW\r\n- http://www.facebook.com/event.php?eid=245657445456739\r\n\r\nWeek of Mon 22nd Aug\r\n\r\nMon 22nd, 7pm - BLACKPOOL - San Marco's, 513 Lytham Road, FY41TE\r\n- http://www.facebook.com/event.php?eid=181620918571041\r\nTue 23rd, 6pm - PRESTON - Mystery Tea House, 23 Cannon St, PR1 3NR\r\n- http://www.facebook.com/event.php?eid=248919695133066\r\nWed 24th, 7pm - LIVERPOOL - The Mocha Lounge, Flat 2, 20 Sir Thomas St, L1 6BA\r\n- http://www.facebook.com/event.php?eid=251880994830507\r\nThu 25th, 7pm - DUBLIN, IRELAND - Accents Coffee & Tea, 23 Stephen Street Lower, Dublin 2\r\n- http://www.facebook.com/event.php?eid=267429799940837\r\nFri 26th, 6pm - WATERFORD, IRELAND - The Book Centre, 25 John Roberts Square\r\n- http://www.facebook.com/event.php?eid=200000396721858\r\nSat 27th, Noon - DUNGARVAN, IRELAND - Nudefood Cafe, 86 O'Connell St\r\n- http://www.facebook.com/event.php?eid=252926214735151\r\nSat 27th, 7pm - CORK, IRELAND - Tribes Coffee Shop, 8 Tuckey Street\r\n- http://www.facebook.com/event.php?eid=252493568101762\r\nSun 28th, 6pm - LIMERICK, IRELAND - O'Connells Bar (formerly Old Quarter Pub & Cafe), Little Ellen St\r\n- http://www.facebook.com/event.php?eid=195543937172677\r\n\r\nWeek of Mon 29th Aug\r\n\r\nMon 29th, 6pm - GALWAY, IRELAND - The Grainstore Cafe, Ground Floor, Lower Abbeygate St\r\n- http://www.facebook.com/event.php?eid=254181474599855\r\nTue 30th, 6pm - BELFAST, IRELAND - Campbell's Caterers, 11 Arthur St, BT1 4GA\r\n- http://www.facebook.com/event.php?eid=238991419468416\r\nWed 31st, 6pm - INVERNESS, SCOTLAND - Gellions, 14 Bridge St, IV1 1HD\r\n- http://www.facebook.com/event.php?eid=254445854583381\r\n\r\nSeptember 2011\r\nScotland, North East, Midlands, and more\r\n\r\nThu 1st Sep, 7pm - ABERDEEN, SCOTLAND - Kilau Coffee, 9A Little Belmont St, AB10 1JG\r\n- http://www.facebook.com/event.php?eid=215995268451055\r\nFri 2nd, 7pm - PERTH, SCOTLAND - Willows Coffee Shop, 12-14 St Johns Place, PH1 5SZ\r\n- http://www.facebook.com/event.php?eid=156535967757273\r\nSat 3rd, Noon - DUNDEE, SCOTLAND - Cafe Buongiorno, 11 Bank St, DD1 1RL\r\n- http://www.facebook.com/event.php?eid=200469786676232\r\nSat 3rd, 6pm - GLASGOW, SCOTLAND - Rio Cafe, 27 Hyndland St, G11 5QF\r\n- http://www.facebook.com/event.php?eid=239926939380357\r\nSun 4th, 7pm - EDINBURGH, SCOTLAND - Beanscene, 95-97 Nicolson St, South Bridge, EH8 9BY\r\n- http://www.facebook.com/event.php?eid=137711716315764\r\n\r\nWeek of Mon 5th Sep\r\n\r\nMon 5th, 7pm - NEWCASTLE - The Blue Bunny Cafe, 11 St. Marys Place, NE1 7PG\r\n- http://www.facebook.com/event.php?eid=229841637051183\r\nTue 6th, 6pm - SUNDERLAND - Signatures, 34 West Sunniside, SR1 1BU\r\n- http://www.facebook.com/event.php?eid=132097436880210\r\nWed 7th, 6pm - MIDDLESBROUGH - Costa Coffee, Teeside Retail Park, Thornaby, Stockton-On-Tees, TS17 7BW\r\n- http://www.facebook.com/event.php?eid=181665001898719\r\nThu 8th, 7pm - SCARBOROUGH - The Nelson, 29 Victoria Rd, Town Centre, YO11 1SB\r\n- http://www.facebook.com/event.php?eid=254700717891583\r\nFri 9th, 6pm - YORK - Victor J Cafe, 1A Finkle St, YO1 8RW\r\n- http://www.facebook.com/event.php?eid=142360179181506\r\nSat 10th, 6pm - LEEDS - Urban Bean, 6 Commercial Rd, LS5 3AQ\r\n- http://www.facebook.com/event.php?eid=238965979467526\r\nSun 11th, 1pm - HARROGATE - Revolution, Royal Baths, 3 Montpellier Gardens, HG1 2WL\r\n- http://www.facebook.com/event.php?eid=189128677816103\r\nSun 11th, 6pm - BRADFORD - The Black Swan, 74 Frizinghall Rd, BD9 4LD\r\n- http://www.facebook.com/event.php?eid=190764847654433\r\n\r\nWeek of Mon 12th Sep\r\n\r\nMon 12th, 6pm - HUDDERSFIELD - Coffeevolution, 8 Church St, HD1 1DD\r\n- http://www.facebook.com/event.php?eid=240153459350899\r\nTue 13th, 7pm - DONCASTER - The White Swan, 34 French Gate, Town Centre, DN1 1QQ\r\n- http://www.facebook.com/event.php?eid=221097531270553\r\nWed 14th, 6pm - HULL - Cuckoos Coffee, 24 Princes Dock St, HU1 2LG\r\n- http://www.facebook.com/event.php?eid=189900194406247\r\nThu 15th, 6pm - LINCOLN - Coffee Aroma, 24 Guildhall St, LN1 1TR\r\n- http://www.facebook.com/event.php?eid=251132574912121\r\nFri 16th, 6pm - SHEFFIELD - The Blue Moon Cafe, 2 St. James St, S1 2EW\r\n- http://www.facebook.com/event.php?eid=185403394859704\r\nSat 17th, 7pm - NOTTINGHAM - Edin's Cafe, 15 Broad St, NG1 3AJ\r\n- http://www.facebook.com/event.php?eid=193515820707448\r\nSun 18th, 4pm - DERBY - Pitcher & Piano, 19-20 Friar Gate, DE1 1BX\r\n- http://www.facebook.com/event.php?eid=128223763939110\r\n\r\nWeek of Mon 19th Sep\r\n\r\nMon 19th, 6pm - STOKE-ON-TRENT - The Fat Cat Cafe, Trinity St, ST1 1HJ\r\n- http://www.facebook.com/event.php?eid=210828915632602\r\nTue 20th, 7pm - LEICESTER - The Crumblin' Cookie, 68 High St, LE1 5YP\r\n- http://www.facebook.com/event.php?eid=128330743926729\r\nWed 21st, 8pm - PETERBOROUGH - Charters, Town Bridge, Peterborough, PE1 1FP\r\n- http://www.facebook.com/event.php?eid=215912025126579\r\nThu 22nd, 6pm - NORTHAMPTON - Fat Cat Cafe Bar, 23 Bridge St, NN1 1NH\r\n- http://www.facebook.com/event.php?eid=213146475403788\r\nFri 23rd, 7.30pm - COVENTRY - Playwrights Cafe, 4-6 Hay Lane, Cathedral Quarter, CV1 5RF\r\n- http://www.facebook.com/event.php?eid=194555207270849\r\nSat 24th, 3pm - WOLVERHAMPTON - Starbucks Coffee, 31 Dudley St, Mander Centre, WV1 3ER\r\n- http://www.facebook.com/event.php?eid=259151737445006\r\nSun 25th, 3pm - BIRMINGHAM - Urban Coffee Company, 30 Church St, B3 2NP\r\n- http://www.facebook.com/event.php?eid=128227530604526\r\n\r\nWeek of Mon 26th Sep\r\n\r\nMon 26th, 7pm - WORCESTER - The Angel @ Worcester, 14 Angel Place, WR1 3QN\r\n- http://www.facebook.com/event.php?eid=253000338051383\r\nTue 27th, 7pm - GLOUCESTER - Cafe Rene, 31 Southgate Street, GL1 1TP\r\n- http://www.facebook.com/event.php?eid=199433950115240\r\nWed 28th, 6pm - SWINDON - Costa Coffee, 7 Havelock Square, SN1 1LE\r\n- http://www.facebook.com/event.php?eid=254729794556081\r\nFri 30th, 6pm - BRIGHTON - Moksha Caffe, 4-5 York Place, BN1 4GU\r\n- http://www.facebook.com/event.php?eid=192298770829434\r\nSat 1st Oct, 8pm - FOLKESTONE - Googies Art Cafe, 15 Rendezvous St, CT20 1EY\r\n- http://www.facebook.com/event.php?eid=132100923546439\r\n\r\nagain, to see a list of all 68 UK shows, go here:\r\nhttp://www.facebook.com/note.php?note_id=135680143183024\r\n\r\n\r\n\r\nSUPPORTING THE TOUR\r\n\r\nThe best way to support Fox's mission is to come to the concert in your area, and bring lots of friends and family (remember it's all ages and free for everyone, no tickets required). \r\n\r\nIf you can't make it, you can always get his CDs (he has 3 double disc CDs available, all for under ten pounds and all funds go towards tour expenses, petrol and food. Hotels are not financially possible so Fox sleeps in his car to continue the tour). The CDs in chronological order are \"Changing History\", \"Momentum\" and \"The Road\", sold online at http://www.elipsus.net/ with a credit card or PayPal. Isn't a PayPal a friend that is only your friend because you give them money?\r\n\r\nFor inquiries and comments, e-mail elipsus@gmail.com\r\n\r\nIf you want to make a donation, there is a button for that on http://www.elipsus.net/, or contact Fox at elipsus@gmail.com or simply PayPal them to elipsus@gmail.com - your donations have kept the music alive for 3 years now. THANK YOU! Read more about how you can help, here: http://bit.ly/BedBrigade - it's like the Fire Brigade, but Bedder.\r\n\r\nIf you want to lend a hand to help Fox spread messages of peace and love through music, email ELIPSUS@GMAIL.COM - This tour depends upon a lot of grass roots internet promotion, very simple tasks that Fox can tell you about one on one, tasks for all skill levels, 10 minutes a week and up helps more than you can imagine :) there's no heaven, it's easy if you try.\r\n\r\n\r\nFOX ELIPSUS, LIVE IN BLACKPOOL\r\nALL CONCERTS ARE FREE, FAMILIES WELCOME!\r\n\r\nFOX ELIPSUS coming all the way from New York\r\nThe only Blackpool performance of the tour...\r\nMonday 22nd August, 2011\r\n7pm until 9pm\r\nSan Marco's\r\n513 Lytham Road\r\nBlackpool, FY41TE, United Kingdom\r\n(01253) 404010\r\n\r\n(note: if you call ahead to this venue and they say they are not sure if or when Fox is coming... do not worry! :) Employees often don't inform all of the rest of the staff about free events. If you ask for the head manager, or whoever books shows, those individuals are more likely to be able to confirm this concert date and time. But remember - staff are very busy, and often forget. Fox will be there, at that address, on time, as advertised. Fox won't cancel shows or advertise the wrong venue or address. Fox will see you there, and is peeing his pants with excitement about this concert by the way) (ew) (I didn't mean it)\r\n\r\nThe 10 shows with the largest audience, the 10 shows with the most CD sales, and the 10 shows with the loudest people, will be immortalized on Fox's official website http://www.elipsus.net/ - so click \"invite people to come\", bring people if you can, spread the word, and enjoy the show... the word immortalized is a bit much so I will leave you with this instead:\r\n\r\nQ: what do you call a characteristic that is inherent with all people named Phillip?\r\nA: an in-Phil-trait",
      "GigTitle": null,
      "Source": "manually input by rhmg",
      "Cancelled": false,
      "Created": "\/Date(1313753099000+0100)\/",
      "Edited": "\/Date(1313753099000+0100)\/"
    }
  ]
}