{
  "Id": "band/1",
  "BandName": "2 Sick Monkeys",
  "MainContactName": "Fred Nus",
  "OtherContacts": [
    "Pete Tower"
  ],
  "ContactEmail": "booking@2sickmonkeys.com",
  "AverageAge": null,
  "Bio": "2 Sick Monkeys formed in December 2000, as a live two piece bass and drums, primarily to support Darrin Mooney (Primal Scream) at a drum event in Swindon.\r\n\r\nThey have now played over 600 gigs (250 in the last 3 years) including 8 European tours.\r\n\r\nThey have built up a strong live following and have supported bands such as Subhumans (3 times), Anti-Nowhere League (twice), Discharge, GBH, The Varukers, Total Chaos (twice), The Buzzcocks, Goldblade, 999 (twice), Citizen Fish, Inner Terrestrials (loads!!), UK Subs, Drongos For Europe (twice), Sham 69, Targetpoint, Captain Everything, The Vibrators, Sonic Boom Six, The Fight and Lord Bishop Rocks.\r\n\r\nTheir influences range from the complex rhythms of Nomeansno to the catchy melodies of Green Day.\r\n\r\nSeptember 2002 saw 2 Sick Monkeys release their debut 5-track CD “Full Flavour Behaviour” and their second CD, the 4-track EP, “Nowhere Nothing”, followed in August 2003.\r\nTheir debut album “Curse of the Monkeys” was released in October 2005.\r\n2008 saw them release the new \"Why?\" EP (in October) and carry on with the relentless gigging.\r\n\r\n2009 was their second busiest year gig-wise with another 95 gigs played including 2 European Tours (one with Dead Subverts in July another on their own in October).\r\n\r\nIn 2010 they released a live album \"Welcome To Shit Street\", recorded in South Wales and there are plans to release several more Live CD's from gigs recorded in Lithuania, Paris and Bristol.\r\nThey ended the year by celebrating their 10th anniversary and by playing their 600th gig.\r\n\r\n2011 will bring the release of the long-awaited second studio album \"Less Is More...More Or Less\" and there is also talk of a split release or another EP.\r\n\r\nEach year has seen the amount of gigs increase and everywhere they’ve played, they’ve been asked back.\r\n\r\nThey describe themselves as tight, melodic and percussively in your face.\r\n\r\nBasically……small outfit, BIG SOUND!!",
  "Style": "Punk Rock",
  "CoverPercentage": 100,
  "OriginalPercentage": 0,
  "MySpaceLink": "http://www.myspace.com/2sickmonkeys",
  "FacebookLink": "https://www.facebook.com/2sickmonkeys",
  "OtherLinks": [
    "http://www.2sickmonkeys.com/",
    "http://www.youtube.com/user/2sickmonkeys",
    "http://www.reverbnation.com/2sickmonkeys",
    "http://www.punkrockers.com/2sickmonkeys",
    "http://www.purevolume.com/2sickmonkeys"
  ],
  "NumberOfBandMembers": "2",
  "HomeTown": "Swindon"
}