{
  "Id": "band/1025",
  "BandName": "3 Daft Monkeys",
  "MainContactName": "David Farrow",
  "OtherContacts": [],
  "ContactEmail": null,
  "AverageAge": null,
  "Bio": "In their own unique DIY style, 3 Daft Monkeys have become one of the most popular touring bands on the UK festival scene. It is refreshing to hear their quirky, original and unusual approach to music, and their exhilarating and energetic live performances draw huge audiences wherever they play.\r\n\r\nTheir songs \"weave whimsy, wit and wisdom through a tapestry of tales, happily skipping across the boundaries of genre to create their own unique style. Hypnotic Klezmer spirals around, romantic Latino vibes flaunt themselves openly, as weird waltzes wander nonchalantly by and a gypsy-jazz vibe wafts through on the breeze\" (Green Man Music). Expect all this at a live 3DM gig, delivered with an underlying celtic vibe, and a warm, witty and intimate approach to their audiences. Youll find the desire to dance irresistible.\r\n\r\nThe release of their latest CD The Antiquated and the Arcane on 1st November 2010 is another landmark in the prolific song writing of the Monkeys, and is already being heralded as their best work to date. It is a very personal but very positive and uplifting piece of work which will make the listener think, question, cry, laugh, and ,of course, dance. It has been described as  \"a rollercoaster journey via the frenetic, the serene and the surreal\"  (West Briton)\r\n\r\nThe band have ploughed their own furrow through the music business, and despite their cottage-industry approach have created a huge buzz right across the music scene in the UK and Europe, where they have drawn in a large and extremely devoted fan base. The band have been played by Mike Harding (Radio 2), and on Late Junction ( Radio 3) as well as enjoying frequent airplay on many local and regional radio stations. Articles about the band can be found in Acoustic Magazine, Rock n Reel, fROOTS, and Songlines,\r\n\r\nRecently the band have appeared on two of the larger Glastonbury stages, Glade and Avalon, pulling crowds well into their thousands, and headlined Folkwoods festival in Holland. The band were also invited back to Fairport Conventions Cropredy festival this year due to popular demand, where the 20,000-strong audience received them with an ecstatic response. 3DM seem to have effortlessly risen to the occasion of the larger audiences they are now attracting, and at Beautiful Days this year treated the audience to a visual and musical extravaganza including a drummer and live VJ screens.\r\n\r\nCome and join audiences of all ages and all backgrounds to see 3 Daft Monkeys live show in a town near you. Their passion, intensity and sheer joy of life mixed with their infectious dancing rhythms will leave you breathless, enthralled and exhilarated.",
  "Style": "Folk Punk",
  "CoverPercentage": 80,
  "OriginalPercentage": 20,
  "MySpaceLink": "http://www.myspace.com/3daftmonkeys",
  "FacebookLink": null,
  "OtherLinks": [
    "http://www.3daftmonkeys.co.uk/"
  ],
  "NumberOfBandMembers": "3",
  "HomeTown": null
}