{
  "Id": "band/1030",
  "BandName": "All Mankind",
  "MainContactName": null,
  "OtherContacts": [],
  "ContactEmail": "management@pangaeaentertainmentgroup.com",
  "AverageAge": null,
  "Bio": "All Mankind have gained a loyal following across the USA, UK, and Australia, having performed over 500 times to more than 100,000 fans. The band's live success has led to independent album sales in the thousands and award nominations for songwriting and performance in both Australia and America.\r\n\r\nThe quartet, originally from Sydney but always on the go, have just finished recording and mixing their debut full-length album with Mike Crossey (Arctic Monkeys, Razorlight, Foals) in Liverpool, England.\r\n\r\nSongs from the band’s previous EPs found their way onto radio stations across the globe (Indie 103.1FM Los Angeles, WRXP New York, MotorFM Germany, KNRK-FM Portland, OR, ABC Radio Australia) while also gaining fans such as Mike Walsh, Music Director at the famed Xfm (UK). A number of tracks also featured in prime time US television shows. \"Open Your Eyes\" was featured as the theme song in the TV promo for Emmy Award-winning ABC TV show \"Jamie Oliver's Food Revolution.\" In addition, their tune \"Hollywood Tonight\" has been heard regularly on MTV's \"The Hills.\"\r\n\r\n'Break the Spell' , the first single from the band’s upcoming album ‘Simple Desire’ has recently been released independently with glowing reviews in the US, UK & Australia. \r\n\r\nUS-based blogger Arjanwrites says, \"With 'Break the Spell,' this Sydney quartet delivers a grand, emotive sound that easily matches the atmospheric qualities of Keane and the propulsive, arena-sized anthems of Coldplay.\" \r\n\r\nEngland's Record of the Day states, \"All Mankind has the sound of being Australia's next biggest export.\"\r\n\r\nMeanwhile, Australian radio personality (and former Xfm UK DJ) Byron Cooke from Australia's Austereo (MMM, 2DAYFM) adds, \"Meet Sydney four-piece All Mankind. I've just been played five tracks from the band's forthcoming debut album. These guys are legit. They mean what they sing. The songs are huge and the album is deep with radio singles. Expect them everywhere, sooner than you think!\"\r\n\r\nThe single has captured early spins on tastemaker radio and tv stations on three continents including Australia (ABC, Channel V, MTV, RAGE, Nova, 2Dayfm, FOX, B105, SAFM, 929 Perth, MMM), USA (KROQ L.A., KNRK Portland OR, KTCL Denver, WCNR Charlottesville VA, plus CHMA, KCRW, KFMA, KPNT, KTCV, WEQX, WNRN, WXPN), Europe (MotorFM, Flux FM, Delta Radio Germany), as well as stations in South America and Asia. ",
  "Style": "Rock",
  "CoverPercentage": 100,
  "OriginalPercentage": 0,
  "MySpaceLink": "http://www.myspace.com/allmankind",
  "FacebookLink": "https://www.facebook.com/allmankindband",
  "OtherLinks": [
    "http://www.allmankind.com/public/Home.html"
  ],
  "NumberOfBandMembers": "4",
  "HomeTown": "Sydney, Australia"
}