{
  "Id": "band/1052",
  "BandName": "Church of Confidence",
  "MainContactName": null,
  "OtherContacts": [],
  "ContactEmail": null,
  "AverageAge": null,
  "Bio": "Founded in Berlin in 1995, Church Of Confidence combined Punk and Rock’n’Roll, just to find out, that with this mixture they were way ahead of their time. \r\nAfter a couple of tours throughout Germany, they recorded their first longplayer in summer 1996 in Lübeck’s “Freshtone-Studios”, which was released in January 1997 on Rodrec/Indigo. \r\nIn the years 1997 and 1998 the band was busy playing support-tours, shows in- and outside of Berlin, as well as playing festivals, but also followed by changing the line-up a couple of times. \r\n\r\nJanuary 1999: Knockout Records releases a 4-track EP entitled “Pray”. Now the world seems to be ready for the sound of the Berlin Punk Rockers, as their style becomes more popular also because of the help of the Scandinavian-Wave. \r\n\r\nNovember 1999. Another Longplayer with the title „Living On Crime” is released on the Berlin-based label ANTI/Zomba.January 2000. The Church Of Confidence stumbles into the new millenium, again with a new line-up, starting off with a furious show, supporting Marky Ramone in Berlin’s legendary SO 36. Three months later they are heading out on the road, to play 12 shows with UK’s ‘77 Punk band “The Buzzcocks”. \r\n\r\nNow the band is being booked for festivals throughout the whole summer and the year closes with a New Years Eve-Show in their homebase, the “Wild At Heart”, located in Berlin-Kreuzberg. Summer 2001. Church Of Confidence produced their third album: „Teaching the children the blues” released on 5th of November on “People Like You” – Records. \r\n\r\nWith their latest album “Teaching The Children The Blues”, they continued to combine late 70’s Punk Rock, early 70’s Glam-Rock and the wild energy of their 50’s Rock’n’Roll heroes, creating their own style, which as the album title implies relates the most important decades of underground rock: \r\n\r\nThe Clash meet The Slade meet Gene Vincent. ",
  "Style": "Punk Rock",
  "CoverPercentage": 100,
  "OriginalPercentage": 0,
  "MySpaceLink": "http://www.myspace.com/churchofconfidence",
  "FacebookLink": null,
  "OtherLinks": [
    "http://www.last.fm/music/Church+of+Confidence"
  ],
  "NumberOfBandMembers": "3",
  "HomeTown": "Berlin"
}