{
  "Id": "band/7169",
  "BandName": "Last Breath",
  "MainContactName": "Melanie Perrett (manager)",
  "OtherContacts": [
    "James Parkinson (lead singer) "
  ],
  "ContactEmail": "melanie.perrett@btinternet.com",
  "AverageAge": null,
  "Bio": "Bio\tLast Breath, a Melodic Rock band from sunny Blackpool, claim “Music is our lives and we intend to make sure it stays that way” No strangers to the stage, Last Breath started back in 2003 as pretty much a covers band playing songs from bands like Nickelback, 3 Doors Down, Metallica etc. ….. until brothers James and Tom realised they have a wonderful natural talent for writing, so as original Last Breath songs emerged the band has become stronger than ever, creating their own identity, and it is now an original band with a pure Rock and Roll vibe and a passion for big things! Their music is now receiving radio airplay worldwide, they are gigging regularly and extending their exposure to a wider audience and ever-increasing fan-base. With their catchy rock pop hooks and low tuned rock riffs, they cross genres from ballads to pounding rock, appealing to all ages. A recent review of their music began “Fresh like the sea breeze, Last Breath has an uplifting and energetic approach to their music. From the moment you dive in, to the second you emerge, the experience is a nonstop whirlwind of exertion.” Performing live is their passion, and it doesn’t take much encouragement from frontman James to get the audiences singing along and hips wiggling, and whether they are playing to a private party or headlining festival full of strangers, this band know how to rock!! ",
  "Style": "Melodic Rock",
  "CoverPercentage": 30,
  "OriginalPercentage": 70,
  "MySpaceLink": "http://www.myspace.com/lastxbreathx",
  "FacebookLink": "http://www.facebook.com/LastBreathFanpage",
  "OtherLinks": [
    "http://www.aspiremusicmanagement.co.uk/LASTBREATH.aspx",
    "http://www.reverbnation.com/lastbreathuk"
  ],
  "NumberOfBandMembers": "4",
  "HomeTown": "Blackpool"
}